[
    {
        "Depth": 1,
        "Title": "Emptiness",
        "Body": "<div class='container'><ul class='message-area'></ul><div class='input-area'></div></div>"
    },
    {
        "Depth": 2,
        "Title": "Worthlessness",
        "Body": "<div class='container'><ul class='message-area'></ul><div class='input-area'></div></div>"
    },
    {
        "Depth": 3,
        "Title": "Facade",
        "Body": "<div class='container'><ul class='message-area'></ul><div class='input-area'></div></div>"
    },
    {
        "Depth": 4,
        "Title": "Alienation",
        "Body": "<div class='container'><ul class='message-area'></ul><div class='input-area'></div></div>"
    },
    {
        "Depth": 0,
        "Title": "The End?",
        "Body": "<h1 class='fade-in'>The End</h1><br><h3 class='fade-in' id='endingtext' style='animation-delay: 4s'></h3>"
    },
    {
        "Depth": 10010,
        "Title": "⠀",
        "Body": "<div class='transitionator fade-in'></div>"
    },
    {
        "Depth": 0.01,
        "Title": "The End?",
        "Body": "<h1 class='fade-in'>The End</h1><br><h3 class='fade-in' id='endingtext' style='animation-delay: 4s'></h3><button class='fade-in' id='notes' style='animation-delay: 8s'>Afterword</button>"
    },
    {
        "Depth": 402,
        "Title": "Afterword",
        "Body": "<p class='thankyou'>To whoever is playing this and has reached this ending, thank you for sticking with this janky and not even that good story. I know it's kinda stupid, I'm not a good writer.<br>And to those who jumped to this page using the fact that this is html and it's open to modding or those who is just reading this from the source code, ayo my fellow nerds, hope you have fun with seeing how bad I did the coding. Also if the indentation is kept as original in the source code, yea, have fun with that too. I know my indentation is really jarring to some but ey, it's what I'm comfortable with. I never liked the JS way where, for example, you do this<br><br>function{<br>&nbsp&nbsp ...<br>}<br><br>I like this way more<br>function<br>{<br>&nbsp&nbsp ...<br>}<br><br>Anyway, coding rant aside, let me start another rant.<br>This wasn't the first project I did. I didn't like, 'oh of course, I did some other project before this one', no, I mean kinda like, this is the second draft. I was planning on doing another story before this one, already planned a lot of stuff and was really exicted to do it, but then after a while of working on the script, I felt like both my writing skill and my coding skill ain't going to be able to bring out the vision I have for this story. It'll go into r/im14andthisisdeep instead of going into filmtheory, y'know? Also because this project was also working as the project for the computer science course, I was like, pressured to do it quick (even if the deadline is next year), so I decided to tug that story under the bed and started on a new story that I can probably whip up the script in 1 day, and so, this current story in which you just suffered through is what came out of my mind during that time.<br><br>But oh no, who's the one writing the story? It's me, so of course it's going to be edgy stuff. I don't know why, but like, whenever I thought up of a story, whether that'd be for a writing project, a show, or a song, it's always gonna be edgy shit. Wait am I allowed to use shit here. uhhhhhhhhh...... welp. <br><br>Anyway, yea, let me told you my chuuni journey. There's this short story I wrote bout a harem anime protag who just got transferred to a school and then this yandere girl kills every girl who's getting close to the protag and finally kills the dude and herself together so that they could be together forever. There's this one that'll be 2 different story. One about a travelling knight, going around killing bad guys, and another one being a scholar and his journey of using his knowledge to improve the lives of people. These 2 stories are going to be connected because surprise, the scholar and the people are actually demons, so in the first story, we were following the knight killing innocents and soemone who genuinely cares about their people getting killed just cus they're not human. I think there's also this one about a lie master for rent. Dude's really good at lying and he just said why not make money out of this. This one is the least edgy out of all the stuff came out of my 8th grade brain I think.<br><br>I'm telling y'all all this cus I'm not going to make them public, all of them are in docs and is probably in the trash, burnt to the ground, no ashes already, so I got no reason to hide.<br><br> Well, those are about my other stuff, and this one ain't that much different. It's still the same ol edgy story. If you felt like this is like, really werid, the story is hard to follow, and you don't understand the story. I don't blame you.<br>So this one is about depression. And what I think is the different effects you can get from it. It's not all, but it's the one that I think I understood the most. After thinking through it myself and asking others, I chose 4 things that I think happen when depression:<br>&nbsp&nbsp - Emptiness<br>&nbsp&nbsp - The feeling of worthlessness and that everything you do is wrong<br>&nbsp&nbsp - Trying to act fine in front of others<br>&nbsp&nbsp - Pushing others away<br><br>So each depth? chapter? layer? idk, each section of the game is split into telling story with those things as the theme. The npc are your mind and y'know how your mind never wants you to be happy, yeah, the npc here are trying their best to not make you try to fix depression. <br><br>The first chapter is pretty simple. Just, emptiness. Void. You feel nothing.<br><br>The second chapter is the feeling that everything you do is just, crap. So the dude the npc is talking shit about is you. And if you join in with the insults, you fell right into their trap. And if you tell yourself to change, then you're not supporting yourself. Thsi is the worst chapter. What I wanted to convey was pretty obscure and yea, it turned out the way it did. If you got an ending where the ending text is just 'I don't know what to say', it's not symbolic of anything, I really didn't know what to say for that ending. And the true ending is to let yourself do whatever you want and be free, not stuck in chain.<br><br>The third chapter is faking yourself to look fine in other's eyes. Also the feeling that your opinion doesn't matter. No matter what you choose, there's it's the same. The hidden options are your actual thoughts and the visible options are what you really think.<br><br>The last chapter is about pushing others away from you even if they want to help you. Let's just assume the 'they' in that chapter are zombies. The zombies are like, your family and friends, trying to help you, but you don't want their help nor do you think they're going to help you.<br><br>Also the eject/inject as the escape button in the first chapter and the pills in the fourth chapter are drugs. Using drugs to try to escape depression, but even if you use it, the game still doesn't care that you use it, so that's why you still come back to the first chapter (yes, very cleaver excuse for not using sessions for remembering progress).<br> Also also, the last page where the tab title change to the beginning instead of the end, yea, cus you're just starting your journey to no more depression. <br><br>I wanted to make use of the web as the game platform, so I was planning to use stuff like, hidden ID, messages told trough the console, hidden messages in the url, cookies. But then I realized that meking things exactly the way I wanted it to be was way way out of my skill level at the moment so I just kept some of those, and also I want to post this on to the web cus I want others to try it too, but I don't want to pay for server (cus I'm broke hahahahahahahhaahaahhahahaaahahhh). That's the reason why instead of having redirects (making it not a static webside from what I understand), I got to store each layout's html code in a text file and use that instead, cus if I do it like that, then the project can be considered as a static website and there are free and stable ways to have a static website. I think there's a high likely chance that I am just stupid here and having redirects doesn't mean it's not a static website, but ey, I didn't want to risk making soemthing, finding out I can't post it online for free, and need to redo a lot of stuff.<br><br>So yeah, the problem of writing this script in a json file is that I can't press enter since there's no doing \"\"\"\"\"\" in json (unless there is, in which case I just showed how stupid I am), so I don't really know how much I wrote or if what I wrote down was cohesive and comprehensible or not, but I'm not going to go back and check cus it's 3pm and I want my snacks now.<br><br>So, have a good day, everyone. Thank you for enduring this bad program. Hope y'all have a meal you like this week.<br><br>Also, before I go, Bae dropped a new album while I was working on this, y'all should listen to it.  <a href='https://youtube.com/playlist?list=OLAK5uy_nKp29RuXFk2zJTVYw5lLD_S0mCI7pSjqo' target='_blank'>ZODIAC</a><br><br>Also was finding a way to post this online and yep, I can confirm, I am stupid. I can use redirects in statics.</p><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><p class='thankyou'>Maybe there's something more at the bottom</p><br><br><br><br><br><br><br><br><br><br><br><br><br> <br><br><br><br><br><br><br><br><br><br><br><br> <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><p class='thought'>I wish I can be braver and not be such a coward. Each time I wanted to say something but I feel like it could made ${} upset, I just resort to stuff like this. Trying to make it seem like what I said wasn't intentional. Sometimes it'd be alc, sometimes sleep deprivation, sometimes braindead, and this time. This. But like, there's so many things I want to say but im scared that if i said it, i'd get block or ignore or the relationship is going to be worse and i don't want that to be. I want us to be at the point where can call already but im just scared that if i said something like that i'd get creeped out or even something worse. maybe it's just one sided closeness. maybe it's just me who thinks we're close but the other side just think of me as another acquintence. fuq how do you spell accquintence. man, i don't know. y'know, the day i dreamt that i said my feelings and ${} said ${} is creeped out and block, i woke up heart beating as fast as when the university admission website said that i didn't pass the score screening. it that bad. i just have 0 courage to say what i want and i know it's bad. it's like saying im fine but im really not. especially when it's just text. I just don't know what the feeling behind text is and i know it's the same over there. no one's knowing each other's tones in what the chat says and ok i think im sidetracking a lot here. well.. let's just leave it there</p><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><p class='thankyou'>Hi there, you found a hidden message. That shows that you sir, are a fellow nerd. Yes, a nerd. I mean i don't even know what a nerd even mean at this point. But ey, nice to call someone nerd just to piss them off cus there are 2 types of people who gets mad at being called a nerd. A real real real nerd. Or a bitch. Yea, I'm just spitting out hottakes after hottakes at this point. I don't even know why I'm writing this. I just want there to be some kind of hidden messages for people thinking there might be hidden lore or soemthing probably. Welp.<br><br> I guess I can tell you that pressing Alt+z in vs code toggles word wrapping, and also when opening ziplocks, instead of pulling the two side apart, you sqeeze the 2 sides with your palm and slide it in opposite direction, you can easily open a ziplock bag.<br><br>Well since you're still reading this. I bet you are either really bord, named dori, or is finding this afterword more enjoyable than the actual game, in which case I understand. The story's pretty badly executed. Hopefully I'll come back to like, remaster it again sometime soon.<br><br>Well writing so much stuff made me remembered something. My friends told me I rant wayyyyyyyy wayyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy too much, and yea, I can see that. I'm trying to fix that, i don't wanna be a karen who rants and get mad over every single thing. <br><br>Anyway, someone also told me you can dox yourself through the moon. I was like, 'huh? what?', and then they told me it's because the moon looks different depending on where on earth you are. Moon is upside down if you're in the Northern hemisphere and the other way around if you're aussie (i know chile and argen and sound af and other southern countries exist but lemme just go with the herd. whenever I saw someone talk about this fact, they always use australia as example.) and the degree of rotation depends on your latitude. If you're on the equator, it looks sideways. So then that takes care of doxxing your latitude, now what about doxxing your longtitude. Well I thought about this and realized about file names. When you take picture through the camera app, they usually name your file with date and time taken. Like, ID_20231203_155044 for a picture taken at December 3rd 2023 at 15h:50m:44s. So if you take a pic of you outside during the morning or evening, they can kinda guess your timezone from how bright it is at that time. Cus the further away from the equator, the more varience in time you got in each season. So, by looking at the date from the file name, they can see which season you're on, and by looking at the time, they can guess which timezone you're on. I mean, I doubt it'll dox a lot of stuff, but if the stalker is very determined or is just crazy good at geoguesser, then it'll give them a general idea of where you are, and maybe that's not what you want. I doubt it'll work that well tho, just randomly thinking about the possibilities. Wait is this me encouraging doxing. ah shit................. Please don't go around doxing people.<br><br><br><br>That talk aside. let me talk about songs. idk how obvious it is yet but yes, I do watch Hololive. Now that people who think anime and vtubers are cringe are now gone, lemme talk about them. Y'all listened to ZODIAC already? It's so fuqing good. Like, the album is such a roller coaster ride, some song is really hype, really upbeat. them immediately followed by a slow Joji vibe song. And it kinda works. Her theme is chaos after all. idk if it's intentional or not but i like it. What's y'all favorite? Mine's Ohayo-EST Gozai-MASTER and 818. Yea, the complete opposite, but I love it.<br><br> This is just talking bout ZODIAC, there's also Pandaemonium. That EP is like, lkjasdgjns so good. All of them. If you ain't gonna listen to ZODIAC cus it's too long, try Pandaemonium.<br><br> That's bout bae, but there's still so many more. Suisei, Kanata, Moona, Towa, Okayu, Calli. Lemme just list the ones I really really like<br><br>•Bae - Ohayo-EST Gozai-MASTER<br>•Bae - Play dice <br>•Bae - Psycho <br>•Bae- Mess <br>•Bae - 818 <br>•Suisei - Damn good day<br>•Suisei - Debutante Ball<br>•Suisei - Aseta Hanamidori<br>•Suisei - Soiree<br>•Suisei - Next color planet<br>•Suisei - Her trail on the celestial sphere<br>•Suisei - Bluerose <br>•Suisei - Je t'aime<br>•Suisei - 3:12<br>•Suisei - Blackhole dancehall<br>•Suisei - sorirokii<br>•Suisei - Rat a tat<br>•Suisei & Kanata - Angelfish (is a cover and is already privated sadly, there are reuploads tho) <br>•Kanata - Betsu sekai <br>•Kanata - Leech<br>•Kanata - snooze (cover)<br>•Calli - Soul food <br>•Calli - Scuffed up age<br>•Calli - Yona yona journey<br>•Fubuki - Konkon beats<br>•Okayu - adieu, salauds<br>•Okayu - Flos (cover)<br>•Botan - Lioness' pride<br>•Towa - Hyakkisai (cover)<br>•Towa - Error (cover)<br>•Towa - Antares <br><br> Y'know what, I just realized doing this is gonna take forever,<a href='https://youtube.com/playlist?list=PLlGbUaMGV46vEmwsyW02KDCoyMNcZoTzd' target='_blank'>lemme just link my playlist here</a>.<br><br> Also have I said yet that I like music? Yea I like music. Anyway, this is probably take way to much of your time, This is supposed to be just a little hidden message so uh, have a good day everyone, i'll go back to being actually productive now instead of procrasinating in here</p>"
    }
]